app/controllers/registrations_controller.rb

INSERT INTO `registrations` (`created_at`, `dob`, `email`, `gender`, `lastname`, `name`, `password`, `updated_at`) VALUES ('2015-01-27 10:42:34', '1992-01-16', 'kaushal@gmail.com', 'Female', 'Patel', 'Kaushal', '1234', '2015-01-27 10:42:34')
---
  def create
  	#render(:action => 'new')
  	#@registration = Registration.create(params[:name], params[:email], params[:dob], params[:password], params[:gender])
    @registration = Registration.new(registration_params)
  	if @registration.save