app/controllers/sessions_controller.rb

SELECT `registrations`.* FROM `registrations` WHERE `registrations`.`email` IS NULL LIMIT 1
---
	def create
		user = Registration.find_by_email(params[:email])